tests23/loadTest1.yml
config:
  target: http://localhost:3044
  phases:
    - duration: 60              ### this phase runs for 60 seconds
      arrivalRate: 2            ### create "5 virutal users per second"
      rampTo: 5                 ### gradually ramp up to "10 new virtual users" by end of phase        
      name: warmUp23
    - duration: 60
      arrivalRate: 5
      rampTo: 50                ### rampup to "50 virtual users per second" by end of 2nd phase
      name: rampUp23
    - duration: 30
      arrivalRate: 10           ### create "10 virtual users per second"
      rampTo: 30
      name: spike23
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:                           #### this loop contains 3 GET APIs; its repeated 87 times
        - get:
            url: "/buffer"
        - get:
            url: "/quote"
        - get:
            url: "/stream"
        count: 87